app/controllers/businesses_controller.rb

  def index
    @businesses = Business.all
---
SELECT * FROM "businesses" WHERE (name LIKE '%%')

  def admin
     @ryan = User.find 1
     @tom = User.find 2
     @brady = User.find 3
     if current_user == @ryan || current_user == @tom || current_user == @brady
      @businesses = Business.all
---
SELECT * FROM "users" WHERE ("users"."id" = '4') LIMIT 1
SELECT * FROM "businesses"

  def show
    @business = Business.find(params[:id])
---
SELECT * FROM "businesses" WHERE ("businesses"."id" = 1)

  def create
    @business = Business.create(params[:business])
    @business.kind = "local"
    @business.name = current_user.campaigns.last.business.name
    if @business.save
---
INSERT INTO "businesses" ("name", "city", "zip", "updated_at", "photo_file_name", "photo_file_size", "photo_updated_at", "lng", "description", "photo_content_type", "address", "lat", "state", "created_at") VALUES('Poopsmiths', 'Midland', 48640, '2010-12-23 06:46:34', '36039_10100367425123924_2311207_67623925_1132323_n.jpg', 62720, '2010-12-23 06:46:31', NULL, 'We Pound Poop With a Hammer.', 'image/jpeg', '4103 Arbor Drive', NULL, 'MI', '2010-12-23 06:46:34')
UPDATE "campaigns" SET "lng" = -118.426839, "business_id" = 6, "lat" = 33.98871, "updated_at" = '2010-12-30 02:41:00' WHERE "id" = 62
UPDATE "users" SET "last_request_at" = '2010-12-29 03:19:14', "updated_at" = '2010-12-29 03:19:14' WHERE "id" = 12

  def edit
    @business = Business.find(params[:id])
---
SELECT * FROM "businesses" WHERE ("businesses"."id" = 1)

  def update
    @business = Business.find(params[:id])
    @business.tag_list = params[:business][:tag_list]
    if @business.update_attributes(params[:business])
      @geocode = Geokit::Geocoders::GoogleGeocoder.geocode "#{@business.address} #{@business.city} #{@business.state} #{@business.zip}"
      @business.campaigns.each do |campaign|
        campaign.lat = @geocode.lat
        campaign.lng = @geocode.lng
        campaign.save!
      end
      if params[:business][:address]
        current_user.points = current_user.points + 10
        current_user.save
      elsif params[:business][:url]
        unless params[:business][:url] == "http://" || params[:business][:url] == ""
          current_user.points = current_user.points + 5
          current_user.save
        end
      elsif params[:business][:photo]
        unless params[:business][:photo] == ""
          current_user.points = current_user.points + 5
          current_user.save
        end
      end
      @achievements = Achievement.find(:all, :conditions => ["user_id = ? AND  state = ?", current_user.id, "unread"])
---
SELECT * FROM "businesses" WHERE ("businesses"."id" = 1)
UPDATE "businesses" SET "photo_content_type" = 'image/jpeg', "zip" = 48640, "photo_file_name" = '36039_10100367425123924_2311207_67623925_1132323_n.jpg', "city" = 'Midland', "name" = '', "photo_updated_at" = '2010-12-22 09:08:17', "photo_file_size" = 62720, "state" = 'MI', "address" = '4103 Arbor Drive', "updated_at" = '2010-12-22 09:08:17' WHERE "id" = 3
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags".id = "taggings".tag_id WHERE (("taggings".taggable_type = 'Business') AND ("taggings".taggable_id = 1))
SELECT * FROM "campaigns" WHERE ("campaigns".business_id = 1)
UPDATE "campaigns" SET "lng" = -118.426839, "lat" = 33.98871, "updated_at" = '2010-12-23 07:41:30' WHERE "id" = 30
SELECT * FROM "achievements" WHERE ("achievements".user_id = 4 AND ("achievements"."type" = 'Shakedown' AND "achievements"."user_id" = 4)) LIMIT 1

  def destroy
    @business = Business.find(params[:id])
    @business.destroy
---
SELECT * FROM "businesses" WHERE ("businesses"."id" = 4)
DELETE FROM "businesses" WHERE "id" = 4