app/controllers/campaigns_controller.rb

  def admin
    @ryan = User.find 1
    @tom = User.find 2
    @brady = User.find 3
    if current_user == @ryan || current_user == @tom || current_user == @brady
     @campaigns = Campaign.all
---
SELECT * FROM "users" WHERE ("users"."id" = '4') LIMIT 1
SELECT * FROM "campaigns"

  def create
    @campaign = current_user.campaigns.new(params[:campaign])
    @business = Business.find_by_name(params[:campaign][:business_name])
    @shortcode = Campaign.find_by_shortcode(params[:campaign][:shortcode])
    @campaign.tag_list = params[:campaign][:tag_list].downcase
    @campaign.kind = params[:campaign][:kind]
    @business_name = params[:campaign][:business_name]
    @business_kind = params[:campaign][:business_kind]
    unless @business.nil?
      if !@shortcode.nil?
      @campaign.business_id = @business.id
      if @campaign.save
        @geocode = Geokit::Geocoders::GoogleGeocoder.geocode "#{@business.address} #{@business.city} #{@business.city} #{@business.zip}"
        @campaign.lat = @geocode.lat
        @campaign.lng = @geocode.lng
        @campaign.save!
        current_user.points = current_user.points + 100
        current_user.save
        @achievements = Achievement.find(:all, :conditions => ["user_id = ? AND  state = ?", @campaign.user.id, "unread"])
        if @achievements.empty?
---
SELECT * FROM "businesses" WHERE ("businesses"."name" = 'business name test!') LIMIT 1
INSERT INTO "campaigns" ("start_date", "end_date", "updated_at", "shortcode", "details", "business_id", "type", "offer", "user_id", "keyword", "created_at") VALUES('2010-12-04 19:39:00', '2011-12-04 19:39:00', '2010-12-04 19:41:34', 12345, 'blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah ', 0, NULL, '40% Linens or Towels', NULL, 'LINEN', '2010-12-04 19:41:34')
INSERT INTO "tags" ("name") VALUES('Bar')
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags".id = "taggings".tag_id WHERE (("taggings".taggable_type = 'Campaign') AND ("taggings".taggable_id = 42))
SELECT * FROM "achievements" WHERE ("achievements".user_id = 4 AND ("achievements"."type" = 'Shakedown' AND "achievements"."user_id" = 4)) LIMIT 1
SELECT * FROM "campaigns" WHERE ("campaigns".user_id = 1)
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
SELECT * FROM "users" ORDER BY users.id DESC LIMIT 1

        @campaign.business_id = @new_business.id
        if @campaign.save
          current_user.points = current_user.points + 100
          current_user.save
---
UPDATE "users" SET "last_request_at" = '2010-12-04 19:57:49', "updated_at" = '2010-12-04 19:57:49' WHERE "id" = 1

  def edit
    @campaign = Campaign.find(params[:id])
---
SELECT * FROM "campaigns" WHERE ("campaigns"."id" = 2)

  def update
    @campaign = Campaign.find(params[:id])
    @campaign.tag_list = (params[:campaign][:tag_list]).downcase
    @campaign.kind = params[:campaign][:kind]
    if @campaign.update_attributes(params[:campaign])
---
SELECT * FROM "campaigns" WHERE ("campaigns"."id" = 2)
UPDATE "campaigns" SET "photo_updated_at" = '2010-12-18 22:36:06', "updated_at" = '2010-12-18 22:36:06' WHERE "id" = 37

  def show
    @campaign = Campaign.find(params[:id])
    @business = @campaign.business
    if current_user && @business.address?
      unless current_user.profile.nil?
        @zip = Geokit::Geocoders::GoogleGeocoder.geocode "#{current_user.profile.zip}"
        if @campaign.lat?
          @distance = @zip.distance_from("#{@campaign.lat}, #{@campaign.lng}").round
        end
      end
    end
    if @business.kind == 'local'
      if @business.address?
        @map = GMap.new("map_div")
        @map.control_init(:large_map => true,:map_type => true)
        @map.center_zoom_init([@campaign.lat, @campaign.lng],15)
        @map.overlay_init(GMarker.new([@campaign.lat, @campaign.lng], :title => "#{@campaign.business.name}", :info_window => "#{@campaign.business.name}"))
      end
    elsif @business.kind == 'chain'
      if @business.locations.exists?
        @map = GMap.new("map_div")
        @map.control_init(:large_map => true,:map_type => true)
        if current_user
          unless current_user.profile.zip.nil?
            @zip = "#{current_user.profile.zip}"
            @location = Location.find_closest(:origin => @zip, :conditions => ["business_id =?", @business.id])
---
SELECT * FROM "campaigns" WHERE ("campaigns"."id" = 1)
SELECT * FROM "profiles" WHERE ("profiles".user_id = 4) LIMIT 1

        @map.overlay_init(GMarker.new([@location.lat, @location.lng], :title => "#{@location.business.name}", :info_window => "#{@location.business.name}"))
      end
    end
    @related = Campaign.find_tagged_with(@campaign.tag_list, :limit => 3)
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags".id = "taggings".tag_id WHERE (("taggings".taggable_type = 'Campaign') AND ("taggings".taggable_id = 30))

  def index
    if params[:search] == "Search for an Offer..." && params[:near] && params[:distance]
      @campaigns = Campaign.location_search("", params[:near], params[:distance])
    elsif params[:search] == "Search for an Offer..." && params[:near]
      @campaigns = Campaign.location_search("", params[:near], 25)
    elsif params[:search] == "Search for an Offer..."
      @campaigns = Campaign.find(:all, :limit => 25)
    elsif params[:search] && params[:near] && params[:distance]
      @campaigns = Campaign.location_search(params[:search], params[:near], params[:distance]) | Campaign.find_tagged_with(params[:search], :origin => params[:near], :within => params[:distance]) | Campaign.no_address_search(params[:search]) | Campaign.find_tagged_with(params[:search], :include => :business, :conditions => ["businesses.address IS ?", nil])
---
SELECT * FROM "businesses" WHERE ("businesses"."id" = 1)
SELECT DISTINCT campaigns.* FROM "campaigns" INNER JOIN taggings campaigns_taggings ON campaigns_taggings.taggable_id = campaigns.id AND campaigns_taggings.taggable_type = 'Campaign' INNER JOIN tags campaigns_tags ON campaigns_tags.id = campaigns_taggings.tag_id WHERE ((campaigns_tags.name LIKE 'yoga'))

  def destroy
    @campaign = Campaign.find(params[:id])
    @votes = Vote.find :all, :conditions => ["voteable_id = ?", params[:id]]
    @votes.each do |v|
      v.destroy
    end
    @user = @campaign.user
    @user.points = @user.points - 200
    @user.save
    @campaign.destroy
---
SELECT * FROM "campaigns" WHERE ("campaigns"."id" = 2)
DELETE FROM "campaigns" WHERE "id" = 2

  def vote_up
    @campaign = Campaign.find(params[:campaign])
    @user = @campaign.user
    current_user.vote_for(@campaign)
    current_user.points = current_user.points + 1
    current_user.save
---
SELECT * FROM "campaigns" WHERE ("campaigns"."id" = 5)
INSERT INTO "votes" ("voteable_id", "voter_id", "updated_at", "vote", "voter_type", "voteable_type", "created_at") VALUES(5, 4, '2010-12-08 07:31:59', 't', 'User', 'Campaign', '2010-12-08 07:31:59')
UPDATE "users" SET "last_request_at" = '2010-12-08 07:31:59', "updated_at" = '2010-12-08 07:31:59' WHERE "id" = 4

  def vote_down
    @campaign = Campaign.find(params[:campaign])
    current_user.vote_against(@campaign)
    current_user.points = current_user.points + 1
    current_user.save
---
SELECT * FROM "campaigns" WHERE ("campaigns"."id" = 5)
INSERT INTO "votes" ("voteable_id", "voter_id", "updated_at", "vote", "voter_type", "voteable_type", "created_at") VALUES(5, 4, '2010-12-08 07:32:39', 'f', 'User', 'Campaign', '2010-12-08 07:32:39')
UPDATE "users" SET "last_request_at" = '2010-12-08 07:32:38', "updated_at" = '2010-12-08 07:32:38' WHERE "id" = 4