app/controllers/campaigns_controller.rb

  def show
    @campaign = Campaign.find(params[:id])
    @business = @campaign.business
    if current_user
      @zip = Geokit::Geocoders::GoogleGeocoder.geocode "#{current_user.profile.zip}"
      @distance = @zip.distance_from("#{@campaign.lat}, #{@campaign.lng}").round
    end
    @map = GMap.new("map_div")
    @map.control_init(:large_map => true,:map_type => true)
    @map.center_zoom_init([@campaign.lat, @campaign.lng],15)
    @map.overlay_init(GMarker.new([@campaign.lat, @campaign.lng], :title => "#{@campaign.business.name}", :info_window => "#{@campaign.business.name}"))
    @related = Campaign.find_tagged_with(@campaign.tag_list, :limit => 3)
---
SELECT * FROM "businesses" WHERE ("businesses"."id" = 0)