app/controllers/comments_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = '4') LIMIT 1
---
  def index
    @comment = Comment.new(params[:comment])
    @user = User.find(params[:user_id])

SELECT * FROM "comments" WHERE ("comments"."id" = 1)
---
  def show
    @comment = Comment.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" = '4') LIMIT 1
INSERT INTO "comments" ("message", "updated_at", "commenter_id", "user_id", "created_at") VALUES('fuckoff!', '2010-12-05 23:41:51', 4, NULL, '2010-12-05 23:41:51')
---
  def create
    @comment = Comment.new(params[:comment])
    @user = User.find(params[:user_id])
    @comment.user_id = @user.id
    @comment.commenter_id = current_user.id
    @comment.save

SELECT * FROM "comments" WHERE ("comments"."id" = 1)
DELETE FROM "comments" WHERE "id" = 1
---
  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy