app/controllers/home_controller.rb

  def index
    @tags = Campaign.tag_counts
    @popular_un_unique = Campaign.find :all, :joins => :votes, :conditions => ["votes.created_at >=?", 1.week.ago], :limit => 5
---
SELECT "campaigns".* FROM "campaigns" INNER JOIN "votes" ON "votes".voteable_id = "campaigns".id AND "votes".voteable_type = 'Campaign' LIMIT 5