app/controllers/profiles_controller.rb

  def update
    @profile = current_user.profile
    if @profile.update_attributes(params[:profile])
---
UPDATE "profiles" SET "photo_content_type" = 'image/jpeg', "photo_file_name" = '36039_10100367425123924_2311207_67623925_1132323_n.jpg', "photo_updated_at" = '2010-12-18 22:20:52', "photo_file_size" = 62720, "updated_at" = '2010-12-18 22:20:52' WHERE "id" = 5
UPDATE "users" SET "last_request_at" = '2010-12-04 23:54:09', "updated_at" = '2010-12-04 23:54:09' WHERE "id" = 4