app/controllers/reviews_controller.rb

  def index
    @review = Review.new(params[:review])
    @campaign = Campaign.find(params[:campaign_id])
---
SELECT * FROM "campaigns" WHERE ("campaigns"."id" = 32)

  def create
    @review = Review.new(params[:review])
    @campaign = Campaign.find(params[:campaign_id])
    @review.campaign_id = @campaign.id
    @review.reviewer_id = current_user.id
    @review.save
    if @review.save
      current_user.points = current_user.points + 5
      current_user.save
---
SELECT * FROM "campaigns" WHERE ("campaigns"."id" = 32)
INSERT INTO "reviews" ("message", "updated_at", "campaign_id", "reviewer_id", "created_at") VALUES('this campaign blows!~', '2010-12-16 05:18:24', 32, 4, '2010-12-16 05:18:24')
UPDATE "users" SET "last_request_at" = '2010-12-16 05:18:24', "updated_at" = '2010-12-16 05:18:24' WHERE "id" = 4