app/controllers/users_controller.rb

SELECT * FROM "users" ORDER BY points DESC
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
SELECT * FROM "campaigns" ORDER BY created_at DESC LIMIT 25
---
  def index
    @users = User.all
    @leaderboard = User.find :all, :order => "points DESC", :limit => 25
    @recent = Campaign.find :all, :order => "created_at DESC", :limit => 25

SELECT * FROM "users"
---
  def admin
     if current_user.role == "admin"
      @users = User.all

SELECT * FROM "users" WHERE ("users"."id" = '4') LIMIT 1
SELECT * FROM "comments" WHERE ("comments".user_id = 4)
SELECT * FROM "votes" WHERE ("votes".voter_id = 4 AND "votes".voter_type = 'User' AND (vote = 'f'))
SELECT count(*) AS count_all FROM "votes" WHERE ("votes".voteable_id = 30 AND "votes".voteable_type = 'Campaign')
SELECT * FROM "reviews" WHERE (reviewer_id in (4))
SELECT * FROM "campaigns" WHERE ("campaigns".user_id = 4)
SELECT * FROM "users" ORDER BY users.id DESC LIMIT 1
SELECT count(*) AS count_all FROM "campaigns" WHERE ("campaigns".user_id = 4)
---
  def show
    @user = User.find(params[:id])
    @comment = Comment.new(params[:comment])
    @commented = Comment.find(:all, :conditions => ["commenter_id in (?)", @user.id])
    @downvotes = @user.votes.find(:all, :conditions => ["vote = ?", false])
    @downvoted = @downvotes.size
    @reviews = Review.find(:all, :conditions => ["reviewer_id in (?)", @user.id])
    @ten_latest = Campaign.find :all, :conditions => ["user_id = ?", @user.id], :limit => 10
    @available = @user.points - @user.redeemed
    @campaigns = Campaign.paginate :page => params[:page], :conditions => ["user_id = ?", @user.id ]

INSERT INTO "users" ("last_login_at", "last_request_at", "updated_at", "crypted_password", "current_login_ip", "points", "password_salt", "current_login_at", "failed_login_count", "persistence_token", "login_count", "login", "email", "last_login_ip", "created_at") VALUES(NULL, '2010-12-06 05:58:58', '2010-12-06 05:58:58', 'ccdff3b9faa31dd18cb8df241a718729489e69e929425de1a5e4d2d5e15edd6e6b455b469b2d2009969056029756ef3cbbd623b8656220d8828a7ff6b8a328d5', '127.0.0.1', 0, 'sS3Yp8tODFLFToQgPOH', '2010-12-06 05:58:58', 0, '12077336a87b34c1cc9aedbc593f73929725c19d934e3d4a54a693db4f3be99d586e57b3bb8f91ac733d8218d79ec24067dae0d2be56fc76a64fcd0f7882a3ce', 1, 'poop', 'poop@poopman.com', NULL, '2010-12-06 05:58:58')
INSERT INTO "profiles" ("name", "zip", "updated_at", "photo_file_name", "photo_file_size", "photo_updated_at", "website", "sex", "quote", "photo_content_type", "birthday", "user_id", "created_at") VALUES(NULL, NULL, '2010-12-18 19:20:10', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2010-12-18 19:20:10')
UPDATE "profiles" SET "updated_at" = '2010-12-04 23:46:54', "user_id" = 4 WHERE "id" = 3
UPDATE "users" SET "points" = 100, "updated_at" = '2010-12-28 20:08:39' WHERE "id" = 12
---
  def create
    @user = User.new(params[:user])
    if verify_recaptcha(:model => @user, :message => 'Whoops, you might be a robot. Try again.') && @user.save
      @profile = Profile.create
      @profile.user_id = @user.id
      @profile.save

UPDATE "users" SET "last_request_at" = '2010-12-04 22:49:17', "updated_at" = '2010-12-04 22:49:17' WHERE "id" = 1
---
  def update
    @user = current_user
    if @user.update_attributes(params[:user])

SELECT * FROM "users" WHERE ("users"."id" = 1)
DELETE FROM "users" WHERE "id" = 1
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy